---
kind: type
id: T:Autodesk.Revit.DB.Events.UndoOperation
source: html/d5c8c31a-3b69-48c0-feac-b176a54e7934.htm
---
# Autodesk.Revit.DB.Events.UndoOperation

The operation associated with DocumentChanged event

## Syntax (C#)
```csharp
public enum UndoOperation
```